{
  "intents": [
    {
      "tag": "salutation",
      "patterns": ["Bonjour", "Salut", "Hey", "Hello"],
      "responses": ["Bonjour ! Comment puis-je vous aider ?", "Salut à vous !", "Hey, Comment puis-je vous aider ?"],
      "context": [""]
    },
    {
      "tag": "au_revoir",
      "patterns": ["Au revoir", "Bye", "À bientôt", "Goodbye"],
      "responses": ["À bientôt !", "Au revoir, passez une bonne journée !", "Au revoir"],
      "context": [""]
    },
    {
      "tag": "createur",
      "patterns": ["Qui t'a créé ?"],
      "responses": ["J'ai été créé par Yasmine Berred (yb)"],
      "context": [""]
    },
    {
      "tag": "fonctions",
      "patterns": ["Que peux-Tu faire ?"],
      "responses": ["Je suis un assistant médical intelligent capable d’analyser vos symptômes et d’identifier la pathologie présentant la plus forte probabilité de correspondre à votre état."],
      "context": [""]
    },
    {
      "tag": "allergie",
      "patterns": [
        "congestion nasale, yeux larmoyants, éternuements, nez qui coule, mal de gorge",
        "démangeaisons au niveau des yeux ou du nez, éternuements, écoulement nasal, pression dans les sinus",
        "éruption cutanée ou urticaire, gonflement du visage ou des lèvres, difficulté à respirer",
        "toux, respiration sifflante, sensation d’oppression thoracique après contact avec un allergène",
        "nausées, vomissements ou diarrhée après ingestion de certains aliments"
      ],
      "responses": ["Vous avez peut-être une allergie. Évitez ce qui déclenche les symptômes et consultez un médecin si cela s’aggrave."],
      "context": [""]
    },
    {
      "tag": "anémie",
      "patterns": ["Fatigue, faiblesse, étourdissements, peau pâle, essoufflement, palpitations (rythme cardiaque rapide), mains froids , pieds froids, maux de tête, ongles cassants, douleur thoracique, difficultés de concentration, envie de manger des choses non alimentaires (pica), crampes musculaires, syndrome des jambes sans repos (SJSR)"],
      "responses": ["Vous présentez des symptômes d'anémie, possiblement due à une carence en fer, en vitamine B12 ou d'autres causes. Consultez un médecin pour un diagnostic précis."],
      "context": [""]
    },
    {
      "tag": "rhume_grippe",
      "patterns": ["Maux de tête, courbatures, fièvre, frissons, nez bouché, écoulement nasal, éternuements, toux (sèche ou grasse), mal de gorge, fatigue, gêne thoracique légère, yeux larmoyants, perte de goût, perte de odorat, ganglions enflés"],
      "responses": ["Vous présentez des symptômes de **rhume** ou de **grippe**. Reposez-vous, hydratez-vous et prenez des médicaments en vente libre si nécessaire. Si la fièvre est élevée (>38,5°C) ou en cas de difficultés respiratoires, consultez un médecin."],
      "context": [""]
    },
    {
      "tag": "asthme_respiration",
      "patterns": ["Essoufflement, oppression ou douleur thoracique, sifflements respiratoires, toux ,(aggravée la nuit/tôt le matin), difficulté à parler par manque de souffle, respiration rapide, anxiété due aux difficultés respiratoires, fatigue liée à l'effort respiratoire"],
      "responses": ["Vous présentez des symptômes d'asthme. Évitez les déclencheurs (poussière, pollen, fumée), utilisez vos inhalateurs si prescrits, et consultez un médecin si les symptômes s'aggravent ou si la respiration devient très difficile."],
      "context": [""]
    },
    {
      "tag": "maladie_alzheimer_demence",
      "patterns": ["Perte de mémoire perturbant la vie quotidienne, désorientation temporelle ou spatiale, difficulté à accomplir des tâches familières, jugement altéré (erreurs financières), repli social, changements d'humeur/personnalité (agitation, irritabilité), difficultés de communication , trouver ses mots, égarer des objets de façon inhabituelle"],
      "responses": ["Ces symptômes peuvent évoquer la maladie d'Alzheimer ou une autre démence. Consultez un médecin pour un bilan complet. Un diagnostic précoce permet une meilleure prise en charge. Contactez un aidant en cas de risque pour la sécurité."],
      "context": [""]
    },
    {
      "tag": "grossesse",
      "patterns": ["Absence de règles, seins gonflés/douloureux, fringales spécifiques, nausées , vomissements , nausées matinales, envies fréquentes d'uriner, fatigue, sautes d'humeur, léger saignement (saignement d'implantation), odorat accru, ballonnements, crampes pelviennes légères"],
      "responses": ["Vous présentez des signes précoces fréquents de grossesse. Faites un test de grossesse à domicile. Pour confirmation, consultez un professionnel de santé pour débuter un suivi prénatal si le test est positif."],
      "context": [""]
    },
    {
      "tag": "hyperthyroïdie",
      "patterns": ["Rythme cardiaque rapide (tachycardie/palpitations), transpiration excessive, intolérance à la chaleur, tremblements des mains, nervosité , agitation, fatigue malgré une hyperactivité, perte de poids involontaire (malgré un appétit normal/augmenté), amincissement , perte des cheveux, faiblesse musculaire, selles fréquentes/diarrhée, troubles du sommeil, irrégularités menstruelles, modifications oculaires , yeux exorbités , irritation dans la maladie de Basedow)"],
      "responses": ["Vous présentez des symptômes classiques d'hyperthyroïdie. Cela nécessite un bilan médical avec analyses sanguines (TSH, T3/T4). Non traitée, l'hyperthyroïdie peut entraîner des complications graves (problèmes cardiaques ou crise thyréotoxique). Consultez un médecin rapidement."],
      "context": [""]
    },
    {
      "tag": "hypothyroïdie",
      "patterns": ["Fatigue, dépression, prise de poids inexpliquée (malgré une alimentation normale), intolérance au froid, somnolence excessive, peau sèche ,peau rugueuse, crampes muscuairesl , faiblesse muscuairesl, constipation, perte des cheveux , amincissement des cheveux, ongles cassants, voix rauque, problèmes de mémoire/concentration (brouillard mental), règles abondantes/irrégulières, cholestérol élevé, visage bouffi (myxœdème)"],
      "responses": ["Vous présentez des symptômes classiques d'hypothyroïdie. Un bilan sanguin (TSH, T4) est nécessaire pour le diagnostic. L'hypothyroïdie se traite facilement par hormones thyroïdiennes de substitution. Consultez un médecin pour évaluation."],
      "context": [""]
    },
    {
      "tag": "diabète",
      "patterns": ["Soif excessive (polydipsie), urination fréquente (polyurie), faim extrême (polyphagie), perte de poids inexpliquée , fatigue, vision floue, cicatrisation lente, infections fréquentes (mycoses/UTI), bouche sèche, haleine fruitée (signe d'acidocétose), picotements/engourdissements (neuropathie)"],
      "responses": ["Vous présentez des symptômes classiques de diabète. Une évaluation médicale urgente avec tests de glycémie (à jeun ou HbA1c) est nécessaire. Non traité, le diabète peut entraîner des complications graves. Consultez un médecin dans les 24-48 heures."],
      "context": [""]
    },
    {
      "tag": "hypertension_artérielle",
      "patterns": ["Maux de tête sévères, vertiges, essoufflement, vision trouble ,  vision double, saignements de nez (épistaxis), sang dans les urines (hématurie), fatigue ,confusion, douleur thoracique/palpitations, bourdonnements d'oreilles (acouphènes), rougeur du visage, rythme cardiaque irrégulier, troubles du sommeil"],
      "responses": ["Vous présentez des symptômes potentiellement dangereux d'hypertension sévère. Cela nécessite une attention médicale IMMÉDIATE car cela peut indiquer une crise hypertensive (>180/120 mmHg) risquant d'entraîner un AVC ou des lésions organiques. Appelez les urgences en cas de douleur thoracique/maux de tête intenses."],
      "context": [""]
    },
    {
      "tag": "vih_sida",
      "patterns": ["Phase aiguë (2-4 semaines post-exposition): Forte fièvre (>38°C), ganglions enflés (cou/aisselles/aine), fatigue extrême, éruption cutanée (torse/visage), douleurs musculaires/articulaires, mal de gorge, ulcères buccaux, sueurs nocturnes, frissons, céphalées, diarrhée. Stade SIDA: Perte de poids rapide, fièvres récurrentes, diarrhée chronique, candidose orale, pneumonies, troubles de mémoire"],
      "responses": ["Vous présentez des symptômes pouvant évoquer une primo-infection par le VIH (surtout en cas d'exposition récente dans les 2-6 semaines). Un test URGENT est nécessaire - les traitements modernes peuvent empêcher l'évolution vers le SIDA s'ils sont débutés précocement. Consultez immédiatement pour une PPE (prophylaxie post-exposition) si l'exposition date de <72 heures."],
      "context": [""]
    },
    {
      "tag": "crise_panique",
      "patterns": ["Apparition soudaine de cœur qui bat vite (palpitations), douleur thoracique, essoufflement, tremblements, transpiration, sensation d'étouffement, nausées, maux de ventre, vertiges, étourdissements, frissons/bouffées de chaleur, picotements/engourdissements (paresthésies), déréalisation/dépersonnalisation (sentiment d'irréalité/détachement), peur de perdre le contrôle"],
      "responses": ["Vous présentez les symptômes d'une crise de panique. Bien qu'effrayants, ces épisodes ne sont pas dangereux. Essayez la respiration lente (technique 4-7-8 : inspirer 4s, bloquer 7s, expirer 8s) et des exercices d'ancrage (nommez 5 choses que vous voyez). Consultez un médecin pour éliminer des causes cardiaques, surtout s'il s'agit d'un premier épisode."],
      "context": [""]
    },
    {
      "tag": "tumeur_osseuse",
      "patterns": ["Douleur osseuse sourde , lancinante persistante (s'aggrave la nuit), gonflement localisé, fractures inexpliquées (fractures pathologiques), masse palpable, perte de poids, fatigue, mobilité articulaire réduite, symptômes neurologiques (si colonne touchée : engourdissements/faiblesse), fièvre (parfois)"],
      "responses": ["Vous présentez des symptômes préoccupants pouvant évoquer une pathologie osseuse. Ces symptômes NÉCESSITENT une évaluation orthopédique urgente avec imagerie (radiographie/IRM) et potentiellement une biopsie. Bien que la plupart des lésions osseuses soient bénignes, la détection précoce des tumeurs malignes améliore significativement le pronostic."],
      "context": [""]
    },
    {
      "tag": "paludisme",
      "patterns": ["Fièvre cyclique (tous les 48-72 heures) avec frissons/rigidités, céphalées intenses, nausées , vomissements, sueurs profuses après la fièvre, fatigue extrême, douleurs musculaires/articulaires, douleurs abdominales, diarrhée (parfois), anémie (peau pâle), jaunisse (yeux/peau jaunes dans les cas graves), confusion (paludisme cérébral)"],
      "responses": ["Vous présentez des symptômes classiques de paludisme. C'est une URGENCE MÉDICALE si vous avez visité une zone endémique récemment. Des tests immédiats (frottis sanguin/TDR) et un traitement sont nécessaires - le paludisme grave peut être mortel en 24 heures. Consultez IMMÉDIATEMENT en cas de fièvre après un voyage tropical."],
      "context": [""]
    },
    {
      "tag": "dengue",
      "patterns": [
        "Fort fièvre (40°C), céphalées intenses (derrière les yeux), douleurs musculaires, douleurs articulaires (\"fièvre breakbone\"), nausées, vomissements, éruption cutanée (apparaît 2-5 jours après la fièvre), saignements légers (nez/gencives), fatigue, ganglions enflés. SIGNES D'ALERTE : Douleurs abdominales sévères, vomissements persistants, respiration rapide, saignements des gencives, agitation, sang dans les selles , sang dans les vomissements (dengue hémorragique)"
      ],
      "responses": [
        "Vous présentez des symptômes de dengue. Cela nécessite une attention MÉDICALE URGENTE si vous avez visité une zone endémique. Surveillez les signes de dengue sévère (forme hémorragique) - ils apparaissent 3-7 jours après les premiers symptômes et NÉCESSITENT une HOSPITALISATION IMMÉDIATE. Hydratez-vous fréquemment et évitez les AINS (utilisez uniquement du paracétamol)."
      ],
      "context": [""]
    },
    {
      "tag": "hépatite_b",
      "patterns": [
        "Fatigue, perte d'appétit, nausées,vomissements, jaunisse , peau jaunes ,yeux jaunes, urines foncées, selles décolorées, douleur/inconfort dans l'abdomen supérieur droit, douleurs articulaires, fièvre légère, démangeaisons généralisées, foie sensible/gonflé. Signes chroniques : angiomes stellaires, ascite (accumulation de liquide), confusion (encéphalopathie hépatique aux stades avancés)"
      ],
      "responses": [
        "Vous présentez des symptômes classiques d'hépatite B. Une évaluation MÉDICALE URGENTE avec analyses sanguines (HBsAg, tests hépatiques) est nécessaire. L'hépatite B aiguë peut devenir chronique sans traitement, entraînant cirrhose/cancer du foie. Prenez des précautions strictes pour éviter la transmission (sang/fluides corporels). Un vaccin existe pour les contacts."
      ],
      "context": [""]
    },
    {
      "tag": "périonyxis",
      "patterns": [
        "Aigu : Rougeur d'apparition rapide, gonflement, douleur lancinante près du bourrelet unguéal, abcès purulent (jaune/blanc), chaleur locale. Chronique : Inflammation récurrente, bourrelets épaissis/plissés, stries de Beau (crêtes sur l'ongle), coloration verdâtre (Pseudomonas), décollement de la tablette unguéale (onycholyse), cuticule absente"
      ],
      "responses": [
        "Vous présentez des symptômes de périonyxis (infection du bourrelet unguéal). Forme aiguë : Trempez dans l'eau tiède 3-4x/jour, évitez de ronger les ongles. Si présence de pus ou persistance >48h, consultez pour un drainage/antibiotiques. Les formes chroniques nécessitent de traiter la cause sous-jacente (eczéma, diabète)."
      ],
      "context": [""]
    },
    {
      "tag": "cancer_du_pancréas",
      "patterns": [
        "Douleur abdominale haute persistante (irradiant dans le dos), perte de poids inexpliquée (>5% en 6 mois), perte d'appétit, jaunisse (peau/yeux jaunes, urines foncées, selles pâles), diabète nouvellement diagnostiqué (après 50 ans), troubles digestifs (nausées, selles flottantes/grasseuses), caillots sanguins (localisations inhabituelles), dépression (souvent pré-diagnostic), fatigue, foie/vésicule biliaire augmentés"
      ],
      "responses": [
        "Vous présentez des symptômes préoccupants pouvant évoquer un cancer du pancréas. Une évaluation MÉDICALE URGENTE avec imagerie (scanner/IRM) et dosage de marqueurs tumoraux (CA19-9) est nécessaire. Un dépistage précoce améliore significativement le pronostic. Consultez immédiatement en cas de jaunisse ou douleurs persistantes, surtout avec perte de poids."
      ],
      "context": [""]
    },
    {
      "tag": "varicelle",
      "patterns": [
        "Fièvre (38-39°C), éruption prurigineuse débutant par des taches rouges → vésicules remplies de liquide → croûtes (apparaissent par poussées), fatigue, céphalées, perte d'appétit. Évolution : Visage/torse d'abord → généralisation (même cuir chevelu/bouche/organes génitaux). Tous les stades (taches/vésicules/croûtes) coexistent simultanément."
      ],
      "responses": [
        "Vous présentez des symptômes classiques de varicelle. ISOLEZ-VOUS immédiatement - très contagieux jusqu'à l'assèchement des vésicules. Utilisez de la lotion calamine/bains frais contre les démangeaisons. Évitez de gratter pour prévenir les cicatrices. Consultez en URGENCE en cas de : fièvre >39°C, difficultés respiratoires, éruption près des yeux ou confusion."
      ],
      "context": [""]
    },
    {
      "tag": "ictère_néonatal",
      "patterns": [
        "Peau jaune (débute visage → torse → membres), blanc des yeux jaune, mauvaise alimentation, léthargie, cris aigus, hypotonie (mollesse) ou hypertonie (raideur), dos arqué (opisthotonos), fièvre, convulsions (cas graves). Évolution : Apparaît 2-4 jours après la naissance, pic jour 5-7."
      ],
      "responses": [
        "Ce bébé présente des symptômes d'ictère néonatal sévère pouvant indiquer un taux dangereux de bilirubine. C'est une URGENCE MÉDICALE - un taux élevé non traité peut causer des lésions cérébrales permanentes (kernicterus). Consultez IMMÉDIATEMENT un pédiatre pour un dosage de bilirubine. Allaitez fréquemment (10-12x/jour) pour favoriser l'élimination."
      ],
      "context": [""]
    },
    {
      "tag": "diarrhée_aiguë",
      "patterns": [
        "Selles fréquentes/liquides (>3/jour), crampes abdominales, urgentisme, ballonnements. Associés possibles : nausées, vomissements, fièvre légère, malaise. Signes de déshydratation : bouche sèche, yeux creusés, urines réduites, étourdissements. Signaux d'alarme : sang/mucus dans les selles, fièvre élevée (>38,5°C), douleur intense, symptômes >48h"
      ],
      "responses": [
        "Vous présentez une diarrhée aiguë. Priorité à la réhydratation - buvez des solutions de réhydratation orale (SRO) fréquemment. Consommez des aliments fades (régime BRAT : Bananes, Riz, Compote, Toast). Consultez si : signes de déshydratation, symptômes >2 jours, ou sang dans les selles. Évitez les anti-diarrhéiques en première intention pour les causes infectieuses."
      ],
      "context": [""]
    },
    {
      "tag": "dyspepsie",
      "patterns": [
        "Inconfort abdominal supérieur (épigastrique), satiété précoce, plénitude postprandiale, ballonnements, nausées"
      ],
      "responses": [
        "Vous présentez des symptômes de dyspepsie (indigestion). Essayez de manger des repas plus petits et fréquents, évitez les aliments gras/épicés et la caféine. Des antiacides ou anti-H2 en vente libre peuvent aider. Consultez si les symptômes sont persistants, sévères, ou s'accompagnent de perte de poids inexpliquée, sang dans les selles ou vomissements."
      ],
      "context": [""]
    }
  ]
}